---
kind: method
id: M:Autodesk.Revit.DB.DimensionSegmentArray.Clear
source: html/8a22aff6-390e-36e3-eaa8-243c36369f64.htm
---
# Autodesk.Revit.DB.DimensionSegmentArray.Clear Method

Removes every item from the array, rendering it empty.

## Syntax (C#)
```csharp
public virtual void Clear()
```